print ("Общество в начале XXI века")
a = int(input("Ваш возрост: "))
if(  a <= 0 or a > 120 ):
    for i in range(0, 5):
        print("Ошибка! Это программа для людей!");
if a>0 and a<7:
    print ("Вам в детский сад")
elif a>=7 and a<18:
    print ("Вам в школу")
elif a>=18 and a<25:
    print ("Вам в профессиональное учебное заведение")
elif a>=25 and a<60:
    print ("Вам на работу")
elif a>=60 and a<120:
    print ("Вам предоставляется выбор")

Напишите программу, которая бы выполняла следующие задачи:
1.выводила название программы "Общество в начале XXI века";
2.запрашивала у пользователя его возраст;
3.если пользователь вводит числа от 0 до 7, то программа выводила надпись "Вам в детский сад";
4.от 7 до 18 - "Вам в школу";
5.от 18 до 25 - "Вам в профессиональное учебное заведение";
6.от 25 до 60 - "Вам на работу";
7.от 60 до 120 – "Вам предоставляется выбор";
8.меньше 0 или больше 120 – пятикратный вывод надписи "Ошибка! Это программа для людей!"
В программе желательно использовать все "атрибуты" структурного программирования: функцию, ветвление и цикл.